In [1]:
###works well if data is not completely missing at random

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [5]:
data=pd.read_csv("titanic_train.csv",usecols=['Age','Fare','Survived'])

In [6]:
data.head()

   Survived   Age     Fare
0         0  22.0   7.2500
1         1  38.0  71.2833
2         1  26.0   7.9250
3         1  35.0  53.1000
4         0  35.0   8.0500

In [7]:
data['Age_impute']=np.where(data['Age'].isnull(),1,0)

In [8]:
data.head()

   Survived   Age     Fare  Age_impute
0         0  22.0   7.2500           0
1         1  38.0  71.2833           0
2         1  26.0   7.9250           0
3         1  35.0  53.1000           0
4         0  35.0   8.0500           0

In [9]:
##Advantages and Disadvantages 
##Advantages 1. easy way to implement  2. captures importance of missing data
##Disadvantages  1. curse of dimensionality